void main(){
// object oriented programming البرمجة الكانئية
//هحتاجها في اي ليه ادرس oop
//  البرامج اللى كنت بنشائها كانت برامج بسيطة زي جمع رقيمن طرح نعمل print كانت حاجات بسيطة جدا وكانت معتمدة على variables
// ليه بقا كانت معتمدة على variables لان انا كنت بستخدم المتغيرات دي عشان تحمل القيم اللى انا مهتمة بيها
//يعني مثلا تحمل name , num , age , price عشان تحمل مجموعة من القيم والقيم بستخدمها في انشاء البرامج بتاعتي
// فكدا البرنامج بيعتمد بشكل كلى على اساس المتغيرات اللى بنشائها
// فلحد دلوقتي مفيش مشاكل خاالصلان خلى بالك بسبب اللى احنا بنعمله ده البرامج اللى احنا بنشائها هي برامج بسيطة جدا يعني اخري هعمل برنامج يجمع رقمين و تخزن بعض البيانات البسيطة زي المنتج والسعر يعني حاجات basic حاجات لو جيت اقارنها بارض الواقع هلاقى ان البرامج على ارض الواقع اكثر تعقيدا بكتير
//oop ---> تحاكي الواقع
// اي حاجة موجودة على ارض الواقع اقدر امثلها في كود
}